// import Blocks from 'widgets/Blocks'

import Block from 'widgets/Form/BlockWithBorder'
import Blocks from 'widgets/Form/Blocks'
import Border from 'widgets/Form/Border'

const listTiles: ListTile[] = []

export default function () {
    return (
        <div className="py-10">
            <h1>
                НО НА САМОМ ДЕЛЕ БОЛЕЕ ЭФФЕКТИВНЫЕ И БЫСТРЫЕ СПОСОБЫ НЕСКОЛЬКО ИНЫЕ:
            </h1>
            
                <Blocks>
                    <Block>
                        <h2>1. Признать свою боль</h2>
                        <p>
                            Не избегайте своих эмоций. Признайте, что вам
                            больно, что вы чувствуете обиду, злость и
                            разочарование. Эти чувства нормальны, и важно
                            позволить себе их испытать.
                        </p>
                    </Block>
                    <Block>
                        <h2>
                            2. Пройти процесс прощения (не для него, а для себя)
                        </h2>
                        <p>
                            Прощение — это не оправдание предательства, а
                            освобождение себя от гнева и обиды. Оно не означает,
                            что вы забываете или оправдываете предателя, но
                            позволяете себе избавиться от тяжелого груза.
                        </p>
                    </Block>
                    <Block>
                        <h2>3. Восстановить самооценку</h2>
                        <p>
                            Предательство часто подрывает уверенность в себе.
                            Важно восстановить свою ценность, понять, что вы
                            достойны любви и уважения, несмотря на чужие ошибки.
                        </p>
                    </Block>
                    <Block>
                        <h2>
                            4. Освободиться от обиды и мести и направить эту
                            энергию на достижение своих целей
                        </h2>
                        <p>
                            Месть и постоянное возвращение к боли только
                            углубляют страдания. Пусть человек, который вас
                            предал, останется в прошлом, а не в вашем настоящем.
                        </p>
                    </Block>
                    <Block>
                        <h2>
                            5. Составить план на будущее: ощутить радость и
                            восстановление
                        </h2>
                        <p>
                            Начните снова ставить цели и достигать их, и строить
                            свою жизнь, не оглядываясь на прошлое. Позвольте
                            себе испытать радость, счастье и новое вдохновение.
                        </p>
                    </Block>
                </Blocks>
            
        </div>
    )
}
