import Block from 'widgets/Form/BlockWithBorder'
import Blocks from 'widgets/Form/Blocks'

export default function () {
    return (
        <div className="py-20 text-center">
            <h2>
                СКОРЕЕ ВСЕГО ТЫ УЖЕ СТОЛКНУЛАСЬ С РАЗВОДОМ И ПРЕДАТЕЛЬСТВОМ ЕСЛИ ТЫ...
            </h2>
            <Blocks>
                <div className="flex-grow basis-0">
                    <h3>«Женщина, которая не имеет внутренней ценности»</h3>
                    <div className="rounded-3xl border-2 p-4 text-yellow-850 bg-orange-75">
                        <p>
                            Ты привыкла заботиться о всех, кроме себя. В
                            отношениях ты всегда готова уступить, подстроиться,
                            закрыть глаза на свои желания ради комфорта
                            партнера. Тебе важно, чтобы любимый человек был
                            доволен, даже если ради этого приходится жертвовать
                            своими потребностями.
                        </p>
                    </div>
                </div>
                <div className="flex-grow basis-0">
                    <h3>«Женщина, которая боится остаться одна»</h3>
                    <div className="rounded-3xl border-2 p-4 text-yellow-850 bg-orange-75">
                        <p>
                            Ты боишься одиночества больше, чем несчастных
                            отношений. Ради сохранения семьи или отношений ты
                            готова терпеть боль, обесценивание, измену и даже
                            предательство. Ты можешь закрывать глаза на
                            очевидные признаки измены, лишь бы не потерять
                            партнера.<br></br>
                        </p>
                    </div>
                </div>
                <div className="flex-grow basis-0">
                    <h3>«Женщина, которая привыкла бороться за любовь»</h3>
                    <div className="rounded-3xl border-2 p-4 text-yellow-850 bg-orange-75">
                        <p>
                            Ты привыкла биться за чувства, доказывать свою
                            значимость, терпеть холодность партнера, надеясь,
                            что он изменится. Тебе кажется, что любовь нужно
                            заслужить, и чем сложнее отношения, тем они ценнее.
                            Чем больше боли в отношениях, тем выше твоя ценность
                        </p>
                    </div>
                </div>
            </Blocks>
            </div>
        
    )
}
