// import Block from 'widgets/BlockWithBorder'
// import Blocks from 'widgets/Blocks'
// import BlocksTwoSubtitles from 'widgets/BlocksTwoSubtitles'
import Blocks from 'widgets/Form/Blocks'
import Block from 'widgets/Form/BlockWithBorder'
import WatchContacts from 'widgets/WatchContacts'

export default function () {
    return (
        <div className="py-10">
            <h1>
                КАК ИЗМЕНИТСЯ ВАШЕ СОСТОЯНИЕ ПОСЛЕ ПЕРЕРАБОТКИ ПРЕДАТЕЛЬСТВА
            </h1>
            <Blocks>
                <Block>
                    <h2>До:</h2>
                    <p>
                        - Потеря уверенности в себе: Предательство может подорвать
                        вашу самооценку, вы начинаете сомневаться в своей
                        ценности, чувствуете себя недостойной любви и уважения.
                    </p>
                    <p>
                        - Постоянные мысли о предателе: Вы не можете избавиться от
                        образа этого человека в своей голове, постоянно думаете
                        о том, что произошло, обдумываете, что могли бы сделать
                        по-другому.
                    </p>
                    <p>
                        - Состояние апатии или разочарования: Вы теряете интерес к
                        жизни, не находите радости в том, что раньше приносило
                        удовольствие. Всё кажется тусклым, а будущее —
                        неопределенным.
                    </p>
                    <p>
                        - Эмоциональная перегрузка: Часто вы чувствуете постоянную
                        тяжесть, тревогу и бессилие, не понимаете, как с этим
                        справиться. Боль от предательства накапливается,
                        превращая каждый день в борьбу с собой.
                    </p> 
                    
                    
                </Block>
                <Block>
                    
                    <h2>После</h2>
                    <p>
                        - Возвращение уверенности: Вы понимаете, что предательство
                        не определяет вашу ценность. Ваша самооценка
                        восстанавливается, вы снова начинаете уважать себя и
                        ценить свои сильные стороны
                    </p>
                    <p>
                        - Спокойствие и прощение: Мышление становится ясным. Вы
                        перестаете думать о человеке, который вас предал, и
                        освобождаетесь от ненужных эмоций. Прощение позволяет
                        вам двигаться дальше, не обращая внимания на тех, кто
                        причинил боль.
                    </p>
               
                    <p>
                        - Энергия и вдохновение: Жизнь снова наполняется смыслом.
                        Вы открываете для себя новые возможности, становитесь
                        готовыми к новым отношениям, достижениям и радостям.
                        Ваша жизнь возвращает свою яркость, и вы начинаете
                        двигаться вперед с уверенностью в будущеe.
                    </p>
                
                    <p>
                        - Энергия и вдохновение: Жизнь снова наполняется смыслом.
                        Вы открываете для себя новые возможности, становитесь
                        готовыми к новым отношениям, достижениям и радостям.
                        Ваша жизнь возвращает свою яркость, и вы начинаете
                        двигаться вперед с уверенностью в будущем.
                    </p>
                </Block>
            </Blocks>
        </div>
    )
}
