import Block from 'widgets/Form/BlockWithBorder'
import Blocks from 'widgets/Form/Blocks'

export default function () {
    return (
        <div className="py-15">
            <h1 className="p-4 uppercase">
                Симптомы, с которыми ко мне обращаются женщины после тяжелого
                развода:
            </h1>
            <ul className="list-decimal ml-10">
                <li>
                    <h2>
                        Постоянная, разрывающая изнутри тоска, которая не
                        утихает ни днём, ни ночью.
                    </h2>
                    <p>
                        Каждое утро начинается с мысли о нём, о том, что
                        произошло и каждую ночь ты засыпаешь со слезами.
                    </p>
                </li>
                <li>
                    <h2>Ощущение пустоты и одиночества</h2>
                    <p>
                        Когда кажется, что никому ты больше не нужна, и впереди
                        только остаток жизни бессмысленного и бесполезного
                        существования.
                    </p>
                </li>
                <li>
                    <h2>Обида и несправедливость</h2>
                    <p>
                        Как он мог так поступить после всего, что вы пережили?
                        Почему именно с тобой это произошло?
                    </p>
                </li>
                <li>
                    <h2>Страх перед будущим</h2>
                    <p>
                        «А вдруг я больше никогда не полюблю? Вдруг останусь
                        одна навсегда?»
                    </p>
                </li>
                <li>
                    <h2>Потеря уверенности в себе</h2>
                    <p>
                        Кажется, что ты стала невидимой, неинтересной, что «та
                        другая лучше» и у тебя нет никаких шансов.
                    </p>
                </li>
                <li>
                    <h2>Физическое и психологическое истощение</h2>
                    <p>
                        Постоянная усталость, нехватка энергии, отсутствие
                        желания что-либо делать, даже вставать по утрам.
                    </p>
                </li>
            </ul>
        </div>
    )
}
