import Block from 'widgets/Form/Block'
import Blocks from 'widgets/Form/Blocks'
import Border from 'widgets/Form/Border'
import NoBorder from 'widgets/Form/NoBorder'

export default function () {
    return (
        <div className="py-10">
            <h1>
                КАКИЕ СПОСОБЫ ЖЕНЩИНЫ ЧАСТО ИСПОЛЬЗУЮТ, КОГДА ПЫТАЮТСЯ СПРАВИТЬСЯ С ДАННОЙ ПРОБЛЕМОЙ?
            </h1>
            <Blocks>
                <Block>
                    <Border>
                        <h2>Игнорирование проблемы</h2>

                        <p>
                            Некоторые женщины стараются забыть о случившемся,
                            как будто ничего не было. Они продолжают жить, как
                            раньше, скрывая свои чувства. Они могут замкнуться в
                            себе, не обсуждать свои переживания и надеяться, что
                            боль пройдет сама собой.
                        </p>
                    </Border>
                    <NoBorder>
                    <p>
                        Он может помочь отвлечься, но только на время, так как
                        боль останется внутри и со временем станет еще сильнее.
                        Игнорирование не решает проблемы, а лишь отдаляет момент
                        её осознания и проработки.
                    </p>
                    </NoBorder>
                </Block>
                <Block>
                    <Border>
                        <h2>Отрицание проблемы и чувства вины</h2>

                        <p>
                            Другие женщины пытаются оправдать предателя, обвиняя
                            себя в том, что произошло. Они думают, что
                            недостаточно хороши, что не заслужили любви или
                            доверия. Это приводит к сильному самокопанию и
                            чувству вины, даже если ответственность лежит не на
                            них.
                        </p>
                    </Border>
                    <NoBorder>
                    <p>
                        Может помочь снизить эмоциональную боль, но только на
                        время, так как чувство вины катастрофически разрушает
                        самооценку и уверенность в себе, делая путь к
                        восстановлению намного сложнее. А иногда и полностью
                        закрывая его.
                    </p>
                    </NoBorder>
                </Block>
                <Block>

                    <Border>
                    <h2>Погружение в обиду и вину</h2>
                    
                    <p>
                        Некоторые женщины начинают постоянно погружаться в
                        негативные чувства: обида, вина, злость и желание
                        отомстить становятся постоянными спутниками. Они могут
                        продолжать возвращаться к происшествию, воссоздавать в
                        голове сцены предательства, обсуждать это с друзьями,
                        накапливая все больше негатива. И в конце концов все это
                        выльется в тяжелый кризис
                    </p>
                    </Border>
                    <NoBorder>
                    <p>
                        Такие отношения часто оказываются проблемными, потому
                        что боль не была проработана, и старые травмы начинают
                        влиять на новые отношения, не давая им развиваться, а
                        только разрушая их.
                    </p>
                    </NoBorder>
                </Block>
            </Blocks>
        </div>
    )
}
