import Block from 'widgets/Form/BlockWithBorder'
import Blocks from 'widgets/Form/Blocks'

export default function () {
    return (
        <div className="py-15">
            <h1>ЧТО БУДЕТ ЕСЛИ ТЫ НЕ ИЗБАВИШЬСЯ ОТ ЭМОЦИОНАЛЬНОЙ БОЛИ ПОСЛЕ РАЗВОДА ИЛИ ПРЕДАТЕЛЬСТВА?</h1>
            <Blocks>
                <Block>
                    <h2>
                        Ты перестанешь верить в любовь и чувства близких людей
                    </h2>
                    <p>
                        После предательства кажется, что доверять никому нельзя.
                        Ты закрываешься от отношений, избегая новых знакомств, а
                        если они случаются — постоянно ждешь подвоха. В итоге
                        счастливая любовь так и не приходит.
                    </p>
                </Block>
                <Block>
                    <h2>Ты можешь снова оказаться в токсичных отношениях</h2>
                    <p>
                        Если боль остается внутри, она становится привычной. Ты
                        можешь бессознательно выбрать такого же партнера,
                        который снова причинит тебе страдания. История
                        предательства повторится, и каждый раз выходить из нее
                        будет сложнее.
                    </p>
                </Block>
                <Block>
                    <h2>Ты потеряешь уверенность в себе</h2>
                    <p>
                        После обмана или предательства многие женщины начинают
                        винить себя: «Я недостаточно хороша», «Меня предали,
                        потому что я не такая, как нужно». Со временем это
                        превращается в низкую самооценку, страх быть отвергнутой
                        и неуверенность в своей ценности.
                    </p>
                </Block>
                <Block>
                    <h2>
                        Ты можешь разрушить свою жизнь погрузившись в пучину
                        тревоги и недоверия
                    </h2>
                    <p>
                        Боль предательства остается в теле и психике.
                        Тревожность, бессонница, раздражительность и недоверие
                        ко всем вокруг становятся частью твоей реальности.
                        Внутри живет страх, что тебя снова обманут, и это мешает
                        не только личной жизни, но и карьере, дружбе и работе.
                    </p>
                </Block>
            </Blocks>
        </div>
    )
}
